index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="fr" xml:lang="fr">
<head>
<!-- 2024-04-07 Sun 15:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Blog</title>
<meta name="author" content="Justin Veilleux" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Blog</h1>
<p>
Hi. I&rsquo;m a computer science student interested in programming language theory,
metaprogramming and mathematics. With this blog, I aim to write concise posts
regarding concept, techniques and ideas that a(slightly) younger version of
myself would have found in his <a href="https://en.wikipedia.org/wiki/Zone_of_proximal_development">zone of proximal development</a>.
</p>
<div id="outline-container-orga3f69fa" class="outline-2">
<h2 id="orga3f69fa"><span class="section-number-2">1.</span> <a href="doing-encapsulation-in-c.html#ID-9b646ba8-977e-495a-a4c5-5e20aacd3d21">Interfaces in C using <code>container_of</code></a></h2>
</div>

<div id="outline-container-orgd6f7aa8" class="outline-2">
<h2 id="orgd6f7aa8"><span class="section-number-2">2.</span> <a href="higher-order-unification.html#ID-df9ac546-8555-4c69-bb14-659a0b556f35">An explanation of higher order unification</a></h2>
</div>

<div id="outline-container-org54c820b" class="outline-2">
<h2 id="org54c820b"><span class="section-number-2">3.</span> <a href="scoped-lambda-terms.html#ID-6d25ece7-27de-4847-a5d8-a5586c72bc6f">Well scoped lambda terms</a></h2>
</div>

<div id="outline-container-orge34c5bd" class="outline-2">
<h2 id="orge34c5bd"><span class="section-number-2">4.</span> <a href="guix.html#ID-1ffbcfb3-9c0d-4776-b163-b737369328b4">Guix: elevate your computing</a></h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Auteur: Justin Veilleux</p>
<p class="date">Created: 2024-04-07 Sun 15:43</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
